# IFC_SetEntityColor

## Description
Sets the default color for an IFC entity type

```pascal
FUNCTION IFC_SetEntityColor(
				inStrIfcType : STRING;
				inRed        : INTEGER;
				inGreen      : INTEGER;
				inBlue       : INTEGER;
				inTransp     : INTEGER): BOOLEAN;
```

```python
def vs.IFC_SetEntityColor(inStrIfcType, inRed, inGreen, inBlue, inTransp):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrIfcType|STRING|   |
|inRed|INTEGER|   |
|inGreen|INTEGER|   |
|inBlue|INTEGER|   |
|inTransp|INTEGER|   |

## Version
Availability: from Vectorworks 2014

## Category
* IFC